Tawank/BruceOS/boards/m5stack-cardputer-adv/sdkconfig.defaults
# M5Stack Cardputer ADV (ESP32-S3, ST7789V2 240x135, TCA8418 keyboard).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_swap.csv"

# Run the supported ESP32 targets at their maximum CPU frequency.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_DATA_CACHE_16KB=y

CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=512

# Disable legacy SSL/TLS protocols and features that are not needed for the
# Cardputer's interactive shell and built-in apps. This reduces the RAM footprint
# of the mbedTLS library, which is otherwise configured for maximum compatibility.
CONFIG_MBEDTLS_SSL_PROTO_SSL3=n
CONFIG_MBEDTLS_SSL_PROTO_TLS1=n
CONFIG_MBEDTLS_SSL_PROTO_TLS1_1=n
CONFIG_MBEDTLS_SSL_PROTO_DTLS=n
CONFIG_MBEDTLS_SSL_RENEGOTIATION=n
CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS=n
CONFIG_MBEDTLS_PSK_MODES=n

# Dynamic memory allocation for BT/BLE
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y

# Management frames are only needed while scanning, associating, or serving
# clients. Do not retain five 500-byte buffers throughout a Wi-Fi session.
# A small dynamic pool still accommodates normal association traffic.
# CONFIG_ESP_WIFI_STATIC_RX_MGMT_BUFFER is not set
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=5

# Internal I2C bus: TCA8418 keyboard and ES8311 codec.
CONFIG_BRUCE_BOARD_I2C_ENABLED=y
CONFIG_BRUCE_BOARD_I2C_SDA_GPIO=8
CONFIG_BRUCE_BOARD_I2C_SCL_GPIO=9
CONFIG_BRUCE_BOARD_I2C_FREQ_HZ=400000

# Display: same ST7789V2 panel and SPI wiring as the original Cardputer.
CONFIG_BRUCE_DISPLAY_WIDTH=135
CONFIG_BRUCE_DISPLAY_HEIGHT=240
CONFIG_BRUCE_DISPLAY_DEFAULT_ROTATION=1
CONFIG_BRUCE_DISPLAY_SPI_HOST=1
CONFIG_BRUCE_DISPLAY_PIN_MOSI=35
CONFIG_BRUCE_DISPLAY_PIN_SCK=36
CONFIG_BRUCE_DISPLAY_SPI_PCLK_HZ=80000000
CONFIG_BRUCE_DISPLAY_PIN_CS=37
CONFIG_BRUCE_DISPLAY_PIN_DC=34
CONFIG_BRUCE_DISPLAY_PIN_RST=33
CONFIG_BRUCE_DISPLAY_PIN_BL=38

# Audio pins are retained; ES8311 control support is still pending.
CONFIG_BRUCE_AUDIO_BACKEND_I2S=y
CONFIG_BRUCE_AUDIO_I2S_BCLK_GPIO=41
CONFIG_BRUCE_AUDIO_I2S_DATA_GPIO=42
CONFIG_BRUCE_AUDIO_I2S_LRCLK_GPIO=43

# Battery.
CONFIG_BRUCE_BATTERY_ENABLED=y
CONFIG_BRUCE_BATTERY_ADC_CHANNEL=9

# SD card: shares the SPI3_HOST radio bus over the Grove port.
CONFIG_BRUCE_SD_ENABLED=y
CONFIG_BRUCE_SD_SPI_HOST=2
CONFIG_BRUCE_SD_PIN_MOSI=14
CONFIG_BRUCE_SD_PIN_MISO=39
CONFIG_BRUCE_SD_PIN_SCK=40
CONFIG_BRUCE_SD_PIN_CS=12

# Buttons: single G0 select button; no A/B/C buttons.
CONFIG_BRUCE_BUTTON_SELECT_ENABLED=y
CONFIG_BRUCE_BUTTON_SELECT_GPIO=0
# CONFIG_BRUCE_BUTTON_A_ENABLED is not set
# CONFIG_BRUCE_BUTTON_B_ENABLED is not set
# CONFIG_BRUCE_BUTTON_C_ENABLED is not set

# ADV keyboard: TCA8418 on the internal I2C bus, address 0x34.
# CONFIG_BRUCE_KEYBOARD_ENABLED is not set
CONFIG_BRUCE_KEYBOARD_TCA8418_ENABLED=y
CONFIG_BRUCE_KEYBOARD_TCA8418_I2C_ADDR=0x34

CONFIG_BRUCE_IR_TX_GPIO=44
CONFIG_BRUCE_IR_RX_GPIO=1

# ADV expansion-header radio mapping.
CONFIG_BRUCE_NRF24_SCK_GPIO=40
CONFIG_BRUCE_NRF24_MISO_GPIO=39
CONFIG_BRUCE_NRF24_MOSI_GPIO=14
CONFIG_BRUCE_NRF24_CS_GPIO=6
CONFIG_BRUCE_NRF24_CE_GPIO=4
